Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Pharmazeutische Präparate für die Behandlung von Epilepsie
en: Pharmaceutical preparations for the treatment of epilepsy

source: Pharmazeutische Präparate zur Behandlung von Verdauungsstörungen
en: Pharmaceutical preparations for treating digestive system disorders

source: Pharmazeutische Präparate zur Behandlung von Hautproblemen
en: Pharmaceutical preparations for treating epidermal problems

source: Pharmazeutische Präparate zur Behandlung von Störungen des Verdauungstraktes
en: Pharmaceutical preparations for treating gastrointestinal disorders

source: Pharmazeutische Präparate für die Behandlung von Mundgeruch
en: Pharmaceutical preparations for treating halitosis

source: Pharmazeutische Präparate zur Behandlung von Hypoglykämie
en: Pharmaceutical preparations for treating hypoglycemia

source: Pharmazeutische Präparate zur Behandlung von Störungen der Sinnesorgane
en: Pharmaceutical preparations for treating sensory organ disorders

source: Desinfizierende Waschlösungen für Obst und Gemüse
en: Sanitizing wash for fruit and vegetables

source: Chirurgische Bandagen
en: Surgical bandages

source: Haftcremes für zahnmedizinische Zwecke
en: Adhesives for dental and dentistry use

source: Tampons für medizinische Zwecke
en: Tampons for medical purposes

source: Heftpflaster für medizinische Zwecke
en: Sticking plasters for medical use

source: Algizide für Schwimmbecken
en: Algicides for swimming pools

source: Medizinische Kräutertees
en: Medicinal herb infusions

source: Materialien zum Verbinden von Wunden
en: Materials for dressing wounds

source: Pharmakologische Hautpflegepräparate
en: Pharmacological preparations for skin care

source: Biochemische Präparate für medizinische Zwecke
en: Biochemical preparations for medical use

source: Pharmazeutische Präparate zur Behandlung von Strahlenkrankheit
en: Pharmaceutical preparations for treating the symptoms of radiation sickness

source: Medizinische Pastillen
en: Medicated lozenges

source: Pharmazeutische Präparate für Inhaliergeräte
en: Pharmaceutical preparations for inhalers

source: Pharmazeutika für die Augen
en: Ocular pharmaceuticals

source: Nahrungsergänzungsmittel für Menschen, nicht für medizinische Zwecke
en: Dietary supplements for humans not for medical purposes

source: Medizinische Präparate
en: Medical preparations

source: Lakritze für pharmazeutische Zwecke
en: Liquorice for pharmaceutical purposes

source: Lakritzenstangen für pharmazeutische Zwecke
en: Stick liquorice for pharmaceutical purposes

source: Weinstein für pharmazeutische Zwecke
en: Tartar for pharmaceutical purposes

source: Weinsteinrahm für pharmazeutische Zwecke
en: Cream of tartar for pharmaceutical purposes

source: Pharmazeutische Präparate
en: Pharmaceutical preparations

source: Chinarinde für medizinische Zwecke
en: Quinquina for medical purposes

source: Chinin für medizinische Zwecke
en: Quinine for medical purposes

source: Nasenreinigungsmittel für medizinische Zwecke
en: Nasal cleaning preparations for medical purposes

source: Wärmepflaster für medizinische Zwecke
en: Heating patches for medical purposes

source: Alkohol für pharmazeutische Zwecke
en: Alcohol for pharmaceutical purposes

source: Präparate aus Mikroorganismen für medizinische oder tierärztliche Zwecke
en: Preparations of microorganisms for medical or veterinary use

source: Nicht medizinische Nahrungsergänzungsmittel
en: Food supplements for non-medical purposes

source: Immunosuppressiva zur Verwendung nach Transplantationen im Falle einer Transplantatabstoßung
en: Immunosuppressants for use following transplantation in the case of graft rejection

source: Pharmazeutische Präparate zur Behandlung von Skeletterkrankungen
en: Pharmaceutical preparations for treating skeletal diseases

source: Pharmazeutische Erzeugnisse zur Behandlung rheumatischer Erkrankungen
en: Pharmaceutical preparations for treating rheumatological diseases

source: Pharmazeutische Präparate für die Behandlung von Arthritis
en: Pharmaceutical preparations for treating arthritis

source: Diätetische Erzeugnisse für Kinder
en: Dietetic preparations for children

source: Reagenzpapier für medizinische Zwecke
en: Reagent paper for medical purposes

source: Sandelholzöl für medizinische, pharmazeutische und tierärztliche Zwecke
en: Sandalwood oil for medical, pharmaceutical and veterinary purposes

source: Mittel gegen Morgenübelkeit
en: Antiemetics for morning sickness

source: Deodorants für Kühlschränke
en: Deodorants for refrigerators

source: WC-Deodorants
en: Toilet deodorants

source: Parenterale pharmazeutische Präparate gegen Epilepsie
en: Parenteral anti-epileptic pharmaceutical preparations

source: Akarizide für gewerbliche Zwecke
en: Acaricides for industrial purposes

source: Paracetamolpräparate zur oralen Verabreichung
en: Paracetamol preparations for oral administration

source: Paracetamolpräparate zur intravenösen Verabreichung
en: Paracetamol preparations for intravenous administration

source: Haftstreifen für Zahnprothesen
en: Adhesive strips for dentures

source: Biologische Adjuvantien für medizinische Zwecke
en: Biological adjuvants for medical purposes

source: Chemische Adjuvantien für medizinische Zwecke
en: Chemical adjuvants for medical purposes

source: Rekonstituierte Zellen für medizinische Hautpflegebehandlungen
en: Reconstituted cells for medical treatments for skin care

source: Rekonstituierte Zellen für klinische Hautpflegebehandlungen
en: Reconstituted cells for clinical treatments for skin care

source: Diätetische Süßungsmittel für medizinische Zwecke
en: Dietetic sweeteners for medical purposes

source: Diagnostikmittel und -materialien
en: Diagnostic preparations and materials

source: Alkaloide für pharmazeutische Zwecke
en: Alkaloids used for pharmaceutical purposes

source: Alginattabletten für pharmazeutische Zwecke
en: Alginate tablets for pharmaceutical purposes

source: Alginatlösungen für pharmazeutische Zwecke
en: Alginate solutions for pharmaceutical purposes

source: Edelmetalllegierungen als Zahnimplantate
en: Alloys of precious metals as dental implants

source: Metalllegierungen für die Zahnrestaurierung
en: Metal alloys for dental restoration purposes

source: Aminosäurepräparate für pharmazeutische Zwecke
en: Amino acid preparations for pharmaceutical use

source: Allgemeine Anästhetika
en: General anaesthetics

source: Analgetika für pharmazeutische Zwecke
en: Analgesics for pharmaceutical use

source: Antibakterielle Schaumreiniger
en: Antibacterial lathering cleanser

source: Antibakterielle Reinigungsmittel
en: Bacteria fighting cleanser

source: Chemische Präparate zur Behandlung von Krebs
en: Anti-cancer preparations of chemical origin

source: Pflanzliche Präparate zur Behandlung von Krebs
en: Anti-cancer preparations of plant origin

source: Mikrobielle Präparate zur Behandlung von Krebs
en: Anti-cancer preparations of microbial origin

source: Präparate zur Behandlung von Krebs aus Hormonen und Antagonisten
en: Anti-cancer preparations from hormones and antagonists

source: Brechmittel zur Behandlung von Brechreiz
en: Anti-emetics used for treating nausea

source: Brechmittel zur Behandlung von Übelkeit
en: Anti-emetics used for treating vomiting

source: Exogene Antigene
en: Exogenous antigens

source: Endogene Antigene
en: Endogenous antigens

source: Virale Antigene
en: Viral antigens

source: Antibakterielle Tonerdepräparate
en: Antibacterial clay preparations

source: Tonerde zur Behandlung von Hautproblemen
en: Clay for treating skin conditions

source: Natürliche Tonerde für therapeutische Zwecke
en: Natural clay for therapeutic purposes

source: Antibakterielle Aknepräparate
en: Antibacterial acne preparations

source: Chemische antineoplastische Präparate
en: Anti-neoplastic preparations of chemical origin

source: Pflanzliche antineoplastische Präparate
en: Anti-neoplastic preparations of plant origin

source: Mikrobielle antineoplastische Präparate
en: Anti-neoplastic preparations of microbial origin

source: Antineoplastische Präparate aus Hormonen und Antagonisten
en: Anti-neoplastic preparations from hormones and antagonists

source: Aus Pflanzen gewonnene Antioxidanzien
en: Anti-oxidants obtained from herbal sources

source: Antioxidanzien bestehend aus Enzymen
en: Anti-oxidants comprising enzymes

source: Aus Honig gewonnene Antioxidanzien
en: Anti-oxidants derived from honey

source: Antioxidantien für medizinische Zwecke
en: Anti-oxidants for medicinal use

source: Pflanzliche Präparate gegen Parasiten
en: Antiparasitic preparations from plant sources

source: Präparate gegen Parasiten für Haustiere
en: Antiparasitic preparations for pets

source: Gegengift zur Behandlung bei Bissen
en: Antivenom for the treatment of bites

source: Gegengift zur Behandlung von Stichen
en: Antivenom for the treatment of stings

source: Antivirale Prodrugs
en: Antiviral prodrugs

source: Aquatische Algizide
en: Aquatic algaecide

source: Mittel gegen Parkinson
en: Antiparkinson agents

source: Anticholinergische Antispasmodika
en: Antimuscarinic antispasmodics

source: Bakteriologische Präparate für pharmazeutische Zwecke
en: Bacteriological preparations for pharmaceutical use

source: Bienenpollen für nutrazeutische Zwecke
en: Bee pollen for nutraceutical use

source: Pflanzliche Entgiftungsmittel
en: Herbal detoxification agents

source: Blutreiniger für Entgiftungszwecke
en: Blood cleaners for detoxification purposes

source: Laxantien für Entgiftungszwecke
en: Laxatives for detoxification purposes

source: Diuretika für Entgiftungszwecke
en: Diuretics for detoxification purposes

source: Mittel gegen Katarrh für Entgiftungszwecke
en: Anticatarrhals for detoxification purposes

source: Mittel zur Alkoholentgiftung
en: Alcohol detoxifying agents

source: Mittel zur metabolischen Entgiftung
en: Metabolic detoxifying agents

source: Natürliche Biozide
en: Natural biocides

source: Synthetische Biozide
en: Synthetic biocides

source: Medizinische Körpergele
en: Medicated body gels

source: Körpercremes für pharmazeutische Zwecke
en: Body creams for pharmaceutical use

source: Körpergele für pharmazeutische Zwecke
en: Body gels for pharmaceutical use

source: Nicht-Dihydropyridin Calciumkanalblocker
en: Non-dihydropyridine calcium channel blockers

source: Baumrinde für neutrazeutische Zwecke
en: Bark for nutraceutical purposes

source: Ethanol für pharmazeutische Zwecke
en: Ethanol for pharmaceutical purposes

source: Kalziumtabletten als Nahrungsergänzungsmittel
en: Calcium tablets as a food supplement

source: Cantharidinextrakte für pharmazeutische Zwecke
en: Cantharides extract for pharmaceutical use

source: Cantharidinpräparate für medizinische Zwecke
en: Cantharides preparations for medical use

source: Cantharidinpräparate für veterinärmedizinische Zwecke
en: Cantharides preparations for veterinary use

source: Kardiovaskuläre Medikamente zur Behandlung von Bluthochdruck
en: Cardiovascular drugs for use in treating hypertension

source: Kardiovasuläre Medikamente zur Verwendung bei Herzinfarkten
en: Cardiovascular drugs used in myocardial infarction

source: Kardiovaskuläre Medikamente zur Behandlung von kongestiver Herzinsuffizienz
en: Cardiovascular drugs used in treating congestive heart failure (CHF)

source: Rizinusöl als Beschichtung für Arzneimittel
en: Castor oil as a coating for pharmaceuticals

source: Analeptische Stimulanzien
en: Analeptic stimulants

source: Aktivkohle für medizinische Zwecke
en: Activated charcoal for medical use

source: Quallenabweisende Sonnenschutzmittel
en: Jellyfish repellent sunscreens

source: Panthenolpräparate für medizinische Zwecke
en: Panthenol preparations for medical use

source: Regulatorproteine für medizinische Zwecke
en: Regulatory proteins for medical use

source: Injizierbare Arzneimittel
en: Injectable pharmaceuticals

source: Pharmazeutische Präparate für die Behandlung von Ösophagitis
en: Pharmaceutical preparations for the treatment of esophagitis

source: Pharmazeutische Erzeugnisse zur Behandlung von Depressionen
en: Pharmaceutical products for the treatment of depression

source: Pharmazeutische Präparate für die Haarpflege
en: Pharmaceutical preparations for hair care

source: Eisformen aus Metall
en: Ice moulds of metal

source: Raketenabschussrampen aus Metall
en: Rocket launching platforms of metal

source: Winkeleisen aus Metall
en: Angle irons of metal

source: Türfüllungen aus Metall
en: Door panels of metal

source: Keramikverstärkte Aluminiumlegierungen
en: Ceramic reinforced aluminium alloys

source: Sperrventile aus Metall [ausgenommen Maschinenteile]
en: Check valves of metal [other than parts of machines]

source: Gewölbe aus Metall
en: Arches of metal

source: Drehscheiben [Eisenbahn]
en: Turntables [railways]

source: Ventilteile aus Metall [ausgenommen Maschinenteile]
en: Valve assemblies of metal [other than parts of machines]

source: Baumaterialien aus Metall
en: Building materials of metal

source: Spannbänder aus Metall für Verpackungszwecke
en: Metal binding strips used on packaging

source: Vogelbäder [Bauten] aus Metall
en: Bird baths [structures] of metal

source: Absperrungen aus Metall für Fernstraßen
en: Barricades for highways (Metal -)

source: Weißmetall
en: White metal

source: Klemmen aus Metall für Rohre
en: Clips of metal for tubes

source: Rollen aus Metall für Schiebefenster
en: Rollers (Metal -) for sliding windows

source: Metallkapitelle als Teile von Pfeilern
en: Capitals (Metal -) being parts of pillars

source: Kassenschließfächer aus Metall
en: Cashiers' lockers of metal

source: Zäune aus Metall
en: Fences of metal

source: Fußböden aus Metalllegierungen
en: Floors made of metal alloys

source: Metallfolie zum Kochen
en: Foils of metal for cooking

source: Nicht leuchtende Hausnummern aus Metall
en: House numbers of metal, non-luminous

source: Leere Werkzeugkästen aus Metall
en: Tool boxes of metal, empty

source: Lagerhäuser aus Metall
en: Warehouses of metal

source: Laufroste aus Metall
en: Duckboards of metal

source: Transportable Gewächshäuser aus Metall für Haushaltszwecke
en: Transportable greenhouses of metal for household use

source: Metallkokillen für Gießereizwecke
en: Ingot moulds of metal for castings

source: Reklametafeln [Tragwerke] aus Metall
en: Advertising hoardings [structures] of metal

source: Bewegungsfuge aus Metall
en: Expansion joints of metal

source: Einlaufschächte aus Metall
en: Gulley shafts of metal

source: Profilierten Metallplatten
en: Profiled slabs (Metal -)

source: Nicht elektrische Türschließer
en: Door closers, non-electric

source: Trennwandplatten aus Metall
en: Dividing wall panels of metal

source: Metallische Schächte zur Kabelverteilung
en: Downpoles of metal for the distribution of cables

source: Schächte aus Metall zur Kabelführung
en: Downpoles of metal for the ducting of wires

source: Entwässerungsprofile aus Metall
en: Drainage profiles of metal

source: Dekorative Actionfiguren aus Bronze
en: Action figures (Decorative -) of bronze

source: Metallventile zur Regelung des Flüssigkeitsdurchflusses in Rohrleitungen
en: Metal valves for controlling the flow of fluids in pipelines

source: Künstliche Fisch-Riffe aus Metall
en: Artificial fish reefs of metal

source: Gewächshäuser aus Metall als ortsfeste Bauten
en: Conservatories of metal being fixed building structures

source: Verkleidungsplatten aus Metall für Dächer
en: Cladding panels of metal for roofing

source: Puffer aus Metall
en: Stops of metal

source: Metalltanks für die Speicherung von Druckgasen
en: Tanks of metal for the storage of compressed gases

source: Mauerwerkanker aus Metall
en: Masonry anchors of metal

source: Mauernägel aus Metall
en: Masonry nails of metal

source: Außenrollläden aus Metall für Fenster
en: Window blinds [outdoor] of metal

source: Metallflaschen für Druckgas
en: Metal bottles for compressed gas

source: Deckenaufhängungen aus Metall für Schilder
en: Ceiling suspension (Metal -) for sign displays

source: Ortsfeste Anlagen für Drahtseilbahnen und Standseilbahnen
en: Materials of metal for funicular railway permanent ways

source: Schwimmcontainer aus Metall
en: Floating containers of metal

source: Eisen
en: Iron

source: Fensterzubehör aus Metall
en: Window furniture of metal

source: Nasenringe für Bullen [Metall]
en: Rings for bulls' noses [metal]

source: Dachkehlbleche aus Blei
en: Roof flashings of lead

source: Figurinen aus Zinn
en: Pewter figurines

source: Ankerbojen aus Metall
en: Mooring buoys of metal

source: Wegweiser aus Metall
en: Signposts made of metal

source: Dachfensterrahmen aus Metall für Gebäude
en: Skylight frames (Metal -) for use in buildings

source: Platten aus unedlem Metall
en: Slabs of common metal

source: Lichtkuppeln [Bauwerk] aus Metall für Gebäude
en: Lighting domes [structures] of metal for buildings

source: Flüssigkeitsspeichertanks [Behälter] aus Metall
en: Liquid storage tanks [containers] made of metal

source: Rohrleitungsverbindungsstücke aus Metall
en: Joint connectors (Metal -) for pipes

source: Transportable Modulbauteile aus Metall
en: Modular portable building units of metal

source: Türen und Fenster aus Metall
en: Doors and windows of metal

source: Leitungen aus Metall für Lüftungsanlagen
en: Ducts of metal for ventilating installations

source: Weinfässer aus Metall
en: Wine casks of metal

source: Ställe [Bauwerke] aus Metall
en: Stables [structures] of metal

source: Aufnahmeständer [Bauwerk] aus Metall für Fahrräder
en: Support stands [structures] of metal for bicycles

source: Gasspeichertanks aus Metall
en: Gas storage tanks of metal

source: Haltegriffe aus Metall
en: Grab rails of metal

source: Schleusentore aus Metall
en: Sluice gates made of metal

source: Metallrampen zum Parken von Fahrzeugen
en: Ramps of metal for parking vehicles

source: Bronzefigurinen als Kunstgegenstände
en: Figurines of bronze being works of art

source: Schraubbefestigungen aus Metall
en: Screw threaded fasteners of metal

source: Metallgleise für Schienenfahrzeuge
en: Metal tracks for rail vehicles

source: Trennbehälter aus Metall
en: Separation tanks of metal

source: Stahlgussstücke [Halbfabrikate]
en: Steel castings [semi-finished]

source: Stahlbleche für Kraftfahrzeugkarosserien
en: Steel sheet for automobile bodies

source: Bau- und Verkleidungspaneele aus Metall
en: Panels of metal for cladding on buildings

source: Metallplatten für Seitenwände
en: Panels of metal for sidewalls

source: Büsten aus Bronze
en: Busts of bronze

source: Verbindungsmuffen aus Metall für Kabel
en: Cable junction sleeves of metal

source: Vorgefertigt Tresorräumen [Bauwerke] aus Metall
en: Prefabricated strongrooms [structures] of metal

source: Gartenpfähle aus Metall
en: Metal garden stakes

source: Rohrkrümmer aus Metall einschließlich aus Stahllegierungen und Titan
en: Elbows of metal for pipes including those from alloy steel and titanium

source: Architraven aus Metall
en: Architraves of metal

source: Gepanzerte Materialien aus Metall
en: Armoured materials of metal

source: Prallwände aus Metall für Turnhallen
en: Baffle walls (Metallic -) for gymnasiums

source: Aluminium mit Bauxitverstärkung
en: Bauxite reinforced aluminium

source: Balken aus unedlen Metallen für Gerüste
en: Beams of common metal for scaffolding

source: Arbeitsplattformen aus Metall zur Verwendung mit Gerüsten
en: Platform staging of metal for use with scaffolding

source: Seilrollen [Kleineisenwaren]
en: Pulleys [metal hardware]

source: Metallschläuche für sanitäre Zwecke
en: Metal hoses for plumbing use

source: Verkehrskegel [nicht mechanisch, nicht leuchtend] aus Metall
en: Road cones [non-mechanical, non-luminous of metal]

source: Metallverbindungsstücke für Rohrleitungen
en: Pipe fittings [junctions] of metal

source: Eckschienen aus Metall für Bauzwecke
en: Brackets of metal for building

source: Kipptüren aus Metall
en: Tilting metal doors

source: Metallsockel [Tragwerke]
en: Pedestals (metal -) [structures]

source: Metalllegierungen zur weiteren Bearbeitung
en: Metal alloys for further manufacturing

source: Metallzylinder [Behälter] für Druckgas oder Flüssigkeiten [leer]
en: Metal cylinders for compressed gas or liquids [empty]

source: Riegel aus Metall
en: Metal dead bolts

source: Ablaufrinnen aus Metall zum Sammeln von Regenwasser
en: Guttering of metal for the collection of rain-water

source: Plastische Kunstgegenstände aus Bronze
en: Sculpted works of art made from bronze

source: Heizkörperventile aus Metall [ausgenommen thermostatische]
en: Radiator valves of metal [other than thermostatic]

source: Versilberte Zinnlegierung
en: Silver-plated tin alloys

source: Schrauben aus Metall für Holz
en: Wood screws made of metal

source: Verriegelungen aus Metall
en: Metal locking mechanisms

source: Fachwerkteile aus Metall
en: Space frames of metal

source: Abstandshalter als Bauteile aus Metall
en: Spacers being building elements made of metal

source: Aufzugseile aus Metall
en: Elevator cables (Metal -)

source: Fahrzeugplaketten aus Metall
en: Badges of metal for vehicles

source: Eisenwaren aus Metall für Bauzwecke
en: Ironmongery of metal for building

source: Einbauplatten aus Metall
en: Chocking metallic plates

source: Armierungen aus Metall für Druckluftleitungen
en: Fittings of metal for compressed air ducts

source: Chromerze
en: Chrome ores

source: Ankernuten aus Metall
en: Anchor channels of metal

source: Fallen aus Metall für wilde Tiere
en: Traps of metal for wild animals

source: Lauben [Bauten] aus Metall
en: Arbours [structures] of metal

source: Metallverbindungsstücke für Rohre
en: Couplings of metal for tubing

source: Schrankscharniere aus Metall
en: Cup swivel joints of metal

source: Schrankbeschläge aus Metall
en: Cupboard fittings of metal

source: Material aus Metall für Baugerüste
en: Materials of metal for scaffolds

source: Metalldraht [unedles Metall]
en: Metal wire [common metal]

source: Metallstangen zur Weiterverarbeitung
en: Metal bars for further manufacture

source: Bauplatten aus Metall
en: Building panels of metal

source: Sammelbüchsen aus Metall
en: Collecting boxes (Metal -)

source: Klemmhülse aus Metall, ausgenommen Maschinenteile
en: Collets of metal, other than parts of machines

source: Metallhalterungen für Kabel
en: Cable supports made of metal

source: Bronzen [Kunstgegenstände]
en: Bronzes [works of art]

source: Leere Werkzeugkoffer aus Metall
en: Tool chests of metal, empty

source: Hühnerställe aus Metall
en: Chicken-houses of metal

source: Rohrstützmuffen aus Metall
en: Pipe support sleeves of metal

source: Metallformen zum Gießen von Keramikmaterialien
en: Molds of metal for casting ceramic materials

source: Wassertanks aus Metall für Haushaltszwecke
en: Water tanks of metal for household purposes

source: Hydrantenkappen aus Metall
en: Hydrant covers of metal

source: Erkennungsmarken aus Metall für Haustiere
en: Identification tags of metal for animals

source: Abflussrinne aus Metall
en: Sluices [drains] of metal

source: Fassadenelemente aus Metall
en: Facade elements of metal

source: Schläuche [aus Metall]
en: Flexible tubes of metal

source: Armierungen für Bauzwecke, aus Metall
en: Reinforcing materials of metal for building

source: Spritzkabinen aus Metall mit integrierter Absauganlage
en: Spray cabinets (Metal -) incorporating extracting installations

source: Druckbetätigte Ringe [Metall]
en: Pressure actuated rings [metal]

source: Druckgefüllte Ringe [Metall]
en: Pressure filled rings [metal]

source: Kuppelförmige Dachlukenfenster aus Metall
en: Dome shaped skylight windows (Metal -)

source: Abflussdeckel aus Metall
en: Drain covers of metal
